Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd.CreateFromCenterline(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ)
Create fabrication routing end from centreline point on straight element.
element:
The straight element that the centerline is on.
ptAt:
A point along the straight element where the fitting to be cut in should be positioned.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd.CreateFromConnector(Autodesk.Revit.DB.Connector)
Create fabrication routing end from connector end point.
connnector:
The connector that the route will connect to. Must not already be connected.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Connector is connected.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd
Class to hold fabrication part routing start or end information.
Remarks:
To create a new instance, use Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd.CreateFromConnector(Autodesk.Revit.DB.Connector) to specify a connector,
or Autodesk.Revit.DB.Fabrication.FabricationPartRouteEnd.CreateFromCenterline(Autodesk.Revit.DB.Element,Autodesk.Revit.DB.XYZ) to specify the centerline of a straight element,
for the fabrication routing end point.
Since:
2017